In [1]:
# Get started with Pandas

In [2]:
# While pandas adpots many coding idioms from NumPy, the biggest difference is that pandas is 
# designed for working with tabular or heterogenous data

# NumPy, is best suited for working with homogenous numerical array data

In [3]:
import pandas as pd

In [4]:
from pandas import Series, DataFrame

In [5]:
# 5.1 Introduction to pandas Data Structures

In [6]:
# Series 
# A Series is a one-dimensional array-like object containing a sequence of avlues (of similar
# types to NumPy types) and an associated array of data labels, called its index

# The simplest Series is formed from only an array of data
obj = pd.Series([4, 7, -5, 3])

In [7]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [8]:
# Since did not specify an index for the data, a default one consisting of the integers 0 
# through N - 1 (where N is the length of the data) is created
# Can get the array representation and index onject of the Series via its values and index 
# attributes, respectivly
obj.values

array([ 4,  7, -5,  3])

In [9]:
obj.index # like range(4)

RangeIndex(start=0, stop=4, step=1)

In [10]:
# It will be desirable to create a Series with an index identifying each data point with a 
# label
obj2 = pd.Series([4, 7, -5, 3], index = ['d', 'b', 'a', 'c'])

In [11]:
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [12]:
obj2.index

Index(['d', 'b', 'a', 'c'], dtype='object')

In [13]:
# Compared with NumPy arrays, can use labels in the index when selecting single values or a set
# of values
obj2['a']

-5

In [14]:
obj2['d'] = 6

In [15]:
obj2[['c', 'a', 'd']]

c    3
a   -5
d    6
dtype: int64

In [16]:
# Using NumPy functions or NumPy-like operations, such as filtering with a boolean array, 
# scalar multiplication, or applying math functions, will preserve the index-value link
obj2[obj2 > 0]

d    6
b    7
c    3
dtype: int64

In [17]:
obj2 * 2

d    12
b    14
a   -10
c     6
dtype: int64

In [21]:
import numpy as np
np.exp(obj2)

d     403.428793
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

In [22]:
# Think about a Series is as a fixed-length, ordered dict, as it is a mapping of index values 
# to data values. Can be used in many contexts where you might use a dict
'b' in obj2

True

In [23]:
'e' in obj2

False

In [24]:
# data contained in a Python dict, can create a Series from it by passing the dict
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon':16000, 'Utah':5000}

In [25]:
obj3 = pd.Series(sdata)

In [26]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [27]:
# When only passing a dict, the index in the resulting series will have the dict's keys in 
# sorted order
# can override this by passing the dict keys in the order you want them to appear in 
# resulting series
states = ['Carlifornia', 'Ohio', 'Oregon', 'Texas']

In [28]:
obj4 = pd.Series(sdata, index = states)

In [29]:
obj4

Carlifornia        NaN
Ohio           35000.0
Oregon         16000.0
Texas          71000.0
dtype: float64

In [30]:
# The isnull and notnull functions in pandas should be used to detect missing data
pd.isnull(obj4)

Carlifornia     True
Ohio           False
Oregon         False
Texas          False
dtype: bool

In [31]:
pd.notnull(obj4)

Carlifornia    False
Ohio            True
Oregon          True
Texas           True
dtype: bool

In [32]:
# Series also has these as instance methods
obj4.isnull()

Carlifornia     True
Ohio           False
Oregon         False
Texas          False
dtype: bool

In [33]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [34]:
obj4

Carlifornia        NaN
Ohio           35000.0
Oregon         16000.0
Texas          71000.0
dtype: float64

In [35]:
obj3 + obj4

Carlifornia         NaN
Ohio            70000.0
Oregon          32000.0
Texas          142000.0
Utah                NaN
dtype: float64

In [36]:
obj4.name = 'population'

In [37]:
obj4.index.name = 'state'

In [38]:
obj4

state
Carlifornia        NaN
Ohio           35000.0
Oregon         16000.0
Texas          71000.0
Name: population, dtype: float64

In [39]:
# A Series's imdex can be altered in-place by assignment
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [40]:
obj.index = ['Bob', 'Steve', 'Jeff', 'Ryan']

In [41]:
obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

In [42]:
# Dataframe: rectangular table of data and contains an ordered collection of columns
# each of which can be a different value type (numeric, string, boolean, etc.)

# Under the hood, the data is stored as one or more two-dimenional blocks rather than
# a list, dict, or some other collection of one-dimensional arrays

# A DataFrame is physically two-dimensional, can use it to represent higher dimensional data 
# in tabular format using hierarchical indexing

In [43]:
# There many ways to construct a DataFrame
# One of the most common is from a dict of equal-length lists or NumPy arrays
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
       'year': [2000, 2001, 2002, 2001, 2002, 2003],
       'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
frame = pd.DataFrame(data)

In [44]:
frame
# The resulting dataframe will have its index assigned automatically as with Series
# the columns are placed in sorted order

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [45]:
frame.head()

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [46]:
pd.DataFrame(data, columns=['year', 'state', 'pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [47]:
frame2 = pd.DataFrame(data, columns=['year', 'state', 'pop', 'debt'],
                     index=['one', 'two', 'three', 'four',
                           'five', 'six'])

In [48]:
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

In [49]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [50]:
# A column in a DataFrame can be retrieved as a Series either by dict-like notation or by 
# attribute
frame2['state']

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
six      Nevada
Name: state, dtype: object

In [51]:
frame2.year

one      2000
two      2001
three    2002
four     2001
five     2002
six      2003
Name: year, dtype: int64

In [52]:
# frame2[column] works for any column name, but frame2.column only works when the column name
# is a valid Python variable name

In [53]:
# Rows can also be retrieved by position or name with the special loc attribute
frame2.loc['three']

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [54]:
frame2['debt'] = 16.5

In [55]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5
six    2003  Nevada  3.2  16.5

In [56]:
frame2['debt'] = np.arange(6.)

In [57]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   0.0
two    2001    Ohio  1.7   1.0
three  2002    Ohio  3.6   2.0
four   2001  Nevada  2.4   3.0
five   2002  Nevada  2.9   4.0
six    2003  Nevada  3.2   5.0

In [58]:
# When assign a Series, its labels will be realigned exactly to the DataFrame's index
# inserting missing values in any holes
val = pd.Series([-1.2, -1.5, -1.7], index = ['two', 'four', 'five'])

In [59]:
frame2['debt'] = val

In [60]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

In [61]:
# Assigning a column that doesn't exist will breate a new column
# The del keyword will delete columns as with a dict
frame2['eastern'] = frame2.state == 'Ohio'

In [62]:
frame2

       year   state  pop  debt  eastern
one    2000    Ohio  1.5   NaN     True
two    2001    Ohio  1.7  -1.2     True
three  2002    Ohio  3.6   NaN     True
four   2001  Nevada  2.4  -1.5    False
five   2002  Nevada  2.9  -1.7    False
six    2003  Nevada  3.2   NaN    False

In [63]:
del frame2['eastern']

In [64]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [65]:
# The column returned from indexing a DataFrame is a view on the underlying data, not a copy.
# Thus, any in-place modifications to the Series will be refelcted in the DataFrame
# The column can be explicitly copied with the Series's copy method

In [66]:
pop = {'Nevada': {2001: 2.4, 2002: 2.9},
      'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

In [67]:
# If the nested dict is passed to the DataFrame, pandas will interpret the outer dict keys as 
# the columns and the inner keys as the row indices
frame3 = pd.DataFrame(pop)

In [68]:
frame3

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

In [69]:
# can transpose the DataFrame with similar syntax to a NumPy array
frame3.T

        2001  2002  2000
Nevada   2.4   2.9   NaN
Ohio     1.7   3.6   1.5

In [70]:
# The keys in the inner dicts are combined and sorted to form the index in the result.
# This isn't true if an explicit index is specified
pd.DataFrame(pop, index = [2001, 2002, 2003])

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

In [71]:
frame3['Ohio']

2001    1.7
2002    3.6
2000    1.5
Name: Ohio, dtype: float64

In [72]:
frame3['Ohio'][:-1]

2001    1.7
2002    3.6
Name: Ohio, dtype: float64

In [73]:
frame3['Nevada']

2001    2.4
2002    2.9
2000    NaN
Name: Nevada, dtype: float64

In [74]:
frame3['Nevada'][:2]

2001    2.4
2002    2.9
Name: Nevada, dtype: float64

In [75]:
pdata = {'Ohio': frame3['Ohio'][:-1], 
         'Nevada': frame3['Nevada'][:2]}

In [76]:
pd.DataFrame(pdata)

      Ohio  Nevada
2001   1.7     2.4
2002   3.6     2.9

In [77]:
# If a DataFrame's index and columns have their name attributes set,
# these will also be displayed
frame3.index.name = 'year'; frame3.columns.name = 'state'

In [78]:
frame3

state  Nevada  Ohio
year
2001      2.4   1.7
2002      2.9   3.6
2000      NaN   1.5

In [79]:
# As with Series, the values attribute returns the data contained in the DataFrame as a 
# two-dimensional ndarray
frame3.values

array([[2.4, 1.7],
       [2.9, 3.6],
       [nan, 1.5]])

In [80]:
# If the DataFrame's columns are different dtypes, the dtype of the values array will be 
# chosen to accommodate all of the columns
frame2.values

array([[2000, 'Ohio', 1.5, nan],
       [2001, 'Ohio', 1.7, -1.2],
       [2002, 'Ohio', 3.6, nan],
       [2001, 'Nevada', 2.4, -1.5],
       [2002, 'Nevada', 2.9, -1.7],
       [2003, 'Nevada', 3.2, nan]], dtype=object)

In [81]:
# Possible data inputs to DataFrame constructor
# 2D ndarray: A matrix of data, passing optional row and column labels

# dict of arrays, lists, or tuples: Each sequence becomes a column in the DataFrame; 
# All sequences must be the same length

# NumPy structured/record array: Treated as the "dict of arrays" case

# dict of Series: Each value becomes a column; indexes from each Series are unioned together
# to form the result's row index if no explicit index is passed

# dict of dicts: Each inner dict becomes a column; keys are unioned to form the row index as
# in the "dict of Series" case

# List of dicts or Series: Each item becomes a row in the DataFrame; union of dict keys or 
# Series indexes become the DataFrame's column labels

# List of lists or tuples: Treated as the "2D ndarray" case

# Another DataFrame: The DataFrame's indexes are used unless different ones are passed

# NumPy MaskedArray: Like the "2D ndarray" case except masked values become NA/missing
# in the DataFrame result

In [82]:
# Index Objects
# Any array or other sequence of labels you use when constructing a Series or DataFrame is 
# internally converted to an Index
obj = pd.Series(range(3), index = ['a', 'b', 'c'])

In [83]:
index = obj.index

In [84]:
index

Index(['a', 'b', 'c'], dtype='object')

In [85]:
index[1:]

Index(['b', 'c'], dtype='object')

In [86]:
#!!Index objects are immutable and thus can't be modified by the user
index[1] = 'd' # Type Error

TypeError: Index does not support mutable operations

In [87]:
# Immutability makes it safer to share Index objects among data structures
labels = pd.Index(np.arange(3))

In [88]:
labels

Int64Index([0, 1, 2], dtype='int64')

In [89]:
obj2 = pd.Series([1.5, -2.5, 0], index = labels)

In [90]:
obj2

0    1.5
1   -2.5
2    0.0
dtype: float64

In [91]:
obj2.index is labels

True

In [92]:
# In addition to being array-like, and index also behaves like a fixed-size set
frame3

state  Nevada  Ohio
year
2001      2.4   1.7
2002      2.9   3.6
2000      NaN   1.5

In [93]:
frame3.columns

Index(['Nevada', 'Ohio'], dtype='object', name='state')

In [94]:
'Ohio' in frame3.columns

True

In [95]:
2003 in frame3.index

False

In [96]:
# Unlike Python sets, a pandas index can contain duplicate labels
dup_labels = pd.Index(['foo', 'foo', 'bar', 'bar'])

In [97]:
dup_labels

Index(['foo', 'foo', 'bar', 'bar'], dtype='object')

In [98]:
# selections with duplicate labels will select all occurrences of that label

In [99]:
# Each index has a number of methods and properties for set logic

# Some index methods and properties
# append: Concatenate with additional index objects, producing a new index
# difference: Compute set difference as an index
# intersection: Compute set intersection
# union: Compute set union
# isin: Compute boolean array indicating whether each value is contained 
# in the passed collection
# delete: Compute new index with element at index i deleted
# drop: Compute new index by deleting passed values
# insert: Compute new index by serting element at index i
# is_monotonic: Returns True if each element is greater than or equal to the previous element
# is_unique: Returns True if the index has no duplicate values
# unique: Compute the array of unique values in the Index

In [100]:
# 5.2 Essential Functionality

In [102]:
# Reindexing
# create a new object with the data conformed to a new index
obj = pd.Series([4.5, 7.2, -5.3, 3.6], index = ['d', 'b', 'a', 'c'])

In [103]:
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [104]:
# introducing missing values if any index values were not already present
obj2 = obj.reindex(['a', 'b', 'c', 'd', 'e'])

In [105]:
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [106]:
# For ordered data like time series, it may be desirable to do some interpolation or filling 
# of values when reindexing.
# The method option allows us to do this, using a method such as ffill, which forward-fills
# the values
obj3 = pd.Series(['blue', 'purple', 'yellow'], index = [0, 2, 4])

In [107]:
obj3

0      blue
2    purple
4    yellow
dtype: object

In [108]:
obj3.reindex(range(6), method = 'ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [109]:
# With DataFrame, reindex can alter either the (row) index, columns, or both
frame = pd.DataFrame(np.arange(9).reshape((3, 3)),
                    index = ['a', 'c', 'd'],
                    columns = ['Ohio', 'Texas', 'California'])

In [110]:
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [111]:
frame2 = frame.reindex(['a', 'b', 'c', 'd'])

In [112]:
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [113]:
# The columns can be reindexed with the columns keyword:
states = ['Texas', 'Utah', 'California']

In [114]:
frame.reindex(columns=states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [115]:
# can reindex more succinctly by label-indexing with loc, and many users prefer to use it
# exclusively
frame.loc[['a', 'b', 'c', 'd'], states]

/Users/xcsm-pc/opt/anaconda3/lib/python3.7/site-packages/pandas/core/indexing.py:1418: FutureWarning:
Passing list-likes to .loc or [] with any missing label will raise
KeyError in the future, you can use .reindex() as an alternative.

See the documentation here:
https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#deprecate-loc-reindex-listlike
  return self._getitem_tuple(key)

   Texas  Utah  California
a    1.0   NaN         2.0
b    NaN   NaN         NaN
c    4.0   NaN         5.0
d    7.0   NaN         8.0

In [116]:
# Reindex function arguments
# index: New sequence to use as index. Can be index instance or any other sequence-like Python
# data structure. An index will be used exactly as is without any copying
# method: 'ffill': fills forward; 'bfill': fills backward
# fill_value: Substitute value to use when introducing missing data by reindexing
# limit: When forward- or backfilling, maximum size gap (in number of elements) to fill
# tolerance: When forward- or backfilling, maximum size gap (in absolute numeric distance
# ) to fill for inexact matches
# level: Match simple index on level of Multiindex; otherwise select subset of
# copy: If True, always copy underlying data even if new index is equivalent to old index
# if false, do not copy the data when the indexes are equivalent

In [117]:
# Dropping Entries from an Axis
# Dropping one or more entries from an axis is easy if you already have an index array
# or list without those entries

In [119]:
# drop method will return a new object with the indicated value or values deleted from an axis
obj = pd.Series(np.arange(5.), index = ['a', 'b', 'c', 'd', 'e'])

In [120]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [121]:
new_obj = obj.drop('c')

In [122]:
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [123]:
obj.drop(['d', 'c'])

a    0.0
b    1.0
e    4.0
dtype: float64

In [124]:
# With DataFrame, index values can be deleted form either axis
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                   index = ['Ohio', 'Colorado', 'Utah', 'New York'],
                   columns=['one', 'two', 'three', 'four'])

In [125]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [126]:
# Drop values from the row labels (axis 0)
data.drop(['Colorado', 'Ohio'])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [127]:
# Can drop values from the columns by passing axis=1 or axis='columns'
data.drop('two', axis=1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [128]:
data.drop(['two', 'four'], axis='columns')

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

In [129]:
# Many functions, like drop which modify the size or shape of a Series or DataFrame,
# can manipulate an object in-place without returning a new object
obj.drop('c', inplace = True)

In [130]:
obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [131]:
# Be careful with the inplace, as it destroys any data that is dropped

In [132]:
# Indexing, Selection, and Filtering

# Series indexing (obj[...]) works analogously to NumPy array indexing, 
# can use the Series' index values instead of only integers
obj = pd.Series(np.arange(4.), index = ['a', 'b', 'c', 'd'])

In [133]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [134]:
obj['b']

1.0

In [135]:
obj[1]

1.0

In [136]:
obj[2:4]

c    2.0
d    3.0
dtype: float64

In [137]:
obj[['b', 'a', 'd']]

b    1.0
a    0.0
d    3.0
dtype: float64

In [138]:
obj[[1, 3]]

b    1.0
d    3.0
dtype: float64

In [139]:
obj[obj < 2]

a    0.0
b    1.0
dtype: float64

In [140]:
#!!! Slicing with labels behaves differently than normal Python slicing in that the end
# point is inclusive
obj['b':'c']

b    1.0
c    2.0
dtype: float64

In [141]:
# Setting using these methods modifies the corresponding section of the Series
obj['b':'c'] = 5

In [142]:
obj

a    0.0
b    5.0
c    5.0
d    3.0
dtype: float64

In [143]:
# Indexing into a DataFrame is for retriving one or more columns either with a single value
# or sequence
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                   index=['Ohio', 'Colorado', 'Utah', 'New York'],
                   columns = ['one', 'two', 'three', 'four'])

In [144]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [145]:
data['two']

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int64

In [146]:
data[['three', 'one']]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

In [147]:
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [148]:
data[data['three'] > 5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [149]:
data < 5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [150]:
data[data < 5] = 0

In [151]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [152]:
# Selection with loc and iloc
# select a subset of rows and columns from a DataFrame with NumPy-like notation using either
# axis labels (loc) or integers (iloc)

In [154]:
data.loc['Colorado', ['two', 'three']]

two      5
three    6
Name: Colorado, dtype: int64

In [155]:
data.iloc[2, [3, 0, 1]]

four    11
one      8
two      9
Name: Utah, dtype: int64

In [156]:
data.iloc[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int64

In [157]:
data.iloc[[1, 2], [3, 0, 1]]

          four  one  two
Colorado     7    0    5
Utah        11    8    9

In [158]:
# Both indexing functions work with slices in addition to single labels or list of labels
data.loc[:'Utah', 'two']

Ohio        0
Colorado    5
Utah        9
Name: two, dtype: int64

In [159]:
data.iloc[:,:3][data.three > 5]

          one  two  three
Colorado    0    5      6
Utah        8    9     10
New York   12   13     14

In [160]:
# Indexing options with DataFraame

# df[val]: Select single column or sequence of columns from the DataFrame;
# special case conveniences; boolean array (filter rows), slice(slice rows), or boolean
# DataFrame(set values based on some criterion)

# df.loc[val]: selects single row or subset of rows from the DataFrame by label
# df.loc[:, val]: selects single column or subset of columns by label
# df.loc[val1, val2]: selects both rows and columns by label
# df.iloc[where]: select single row or subset of rows from the DataFrame by integer position

# df.iloc[:, where]: selects single column or subset of columns by integer position
# df.iloc[where_i, where_j]: select both rows and columns by integer position

# df.at[label_i, label_j]: select a single scalar value by row and column label
# df.iat[i, j]: select a single scalar value by row and column position (integers)
# reindex method: select either rows or columns by labels
# get_value, set_value: select single value by row and column label

In [161]:
# Integer Indexed

# Working with pandas objects indexed by integers is something that often trips up new users
# due to some differences with indexing semantics on built-in Python data structures like 
# lists and tuples

# will generate error
ser = pd.Series(np.arange(3.))
ser
ser[-1]

KeyError: -1

In [162]:
# pandas could "fall back" on interger indexing, but it's difficult to do this in general
# without introducing subtle bugs.
# We have an index containing 0, 1, 2, but inferring what the user wants (label-based 
# indexing or position-based) is difficult
ser

0    0.0
1    1.0
2    2.0
dtype: float64

In [163]:
# With a non-integer index, there is no potential for ambiguity
ser2 = pd.Series(np.arange(3.), index = ['a', 'b', 'c'])

In [164]:
ser2[-1]

2.0

In [165]:
# To keep things consistent, if you have an axis index containing integers, data selection wil
# always be label-oriented. 
# For more precise handling, use loc (for labels) or iloc (for integers)
ser[:1]

0    0.0
dtype: float64

In [166]:
ser.loc[:1]

0    0.0
1    1.0
dtype: float64

In [167]:
ser.iloc[:1]

0    0.0
dtype: float64

In [168]:
# Arithmetic and Data Alignment
s1 = pd.Series([7.3, -2.5, 3.4, 1.5], index = ['a', 'c', 'd', 'e'])

In [170]:
s2 = pd.Series([-2.1, 3.6, -1.5, 4, 3.1], index = ['a', 'c', 'e', 'f', 'g'])

In [171]:
s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [172]:
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [173]:
s1 + s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [174]:
# The internal data alignment introduces missing values in the label locations that don't 
# overlap

In [175]:
df1 = pd.DataFrame(np.arange(9.).reshape((3, 3)), columns=list('bcd'), 
                   index=['Ohio', 'Texas', 'Colorado'])

In [176]:
df2 = pd.DataFrame(np.arange(12.).reshape((4, 3)), columns=list('bde'), 
                   index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [177]:
df1

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

In [178]:
df2

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [179]:
df1 + df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

In [180]:
df1 = pd.DataFrame({'A': [1, 2]})

In [181]:
df2 = pd.DataFrame({'B': [3, 4]})

In [182]:
df1

   A
0  1
1  2

In [183]:
df2

   B
0  3
1  4

In [184]:
df1 - df2

    A   B
0 NaN NaN
1 NaN NaN

In [185]:
# Arithmetic methods with fill values

# In arithmetic operations between differently indexed objectsm you might want to fill with
# special value, like 0, when an axis label is found in one object but not the other
df1 = pd.DataFrame(np.arange(12.).reshape((3, 4)), 
                   columns=list('abcd'))

In [186]:
df2 = pd.DataFrame(np.arange(20.).reshape((4, 5)), 
                   columns=list('abcde'))

In [187]:
df2.loc[1, 'b'] = np.nan

In [188]:
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [189]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   NaN   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [190]:
df1 + df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0   NaN  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [191]:
# Using the add method on df1, I pass df2 and an argument to fill_value
df1.add(df2, fill_value = 0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0   5.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [192]:
# For a listing of Series and DataFrame methods for arithmetic
# Each of them has a counterpart, starting with the letter r, that has arguments flipped.
# So these two statements are equivalent
1 / df1

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

In [193]:
df1.rdiv(1)

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

In [194]:
# When reindexing a Series or DataFrame, you can also specify a different fill value
df1.reindex(columns = df2.columns, fill_value = 0)

     a    b     c     d  e
0  0.0  1.0   2.0   3.0  0
1  4.0  5.0   6.0   7.0  0
2  8.0  9.0  10.0  11.0  0

In [195]:
# Flexible arithmetic methods

# add, radd: Methods for addition(+)
# sub, rsub: Methods for subtraction(-)
# div, rdiv: Methods for division(/)
# floordiv, rfloordiv: Methods for floor division(//)
# mul, rmul: Methods for multiplication (*)
# pow, rpow: Methods for exponentiation (**)

In [197]:
# Operations between DataFrame and Series
# As with NumPy arrays of different dimensions, arithmetic between DataFrame and Series 
# is also defined
arr = np.arange(12.).reshape((3, 4))

In [198]:
arr

array([[ 0.,  1.,  2.,  3.],
       [ 4.,  5.,  6.,  7.],
       [ 8.,  9., 10., 11.]])

In [199]:
arr[0]

array([0., 1., 2., 3.])

In [200]:
arr - arr[0]

array([[0., 0., 0., 0.],
       [4., 4., 4., 4.],
       [8., 8., 8., 8.]])

In [201]:
frame = pd.DataFrame(np.arange(12.).reshape((4, 3)), 
                     columns=list('bde'),
                    index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [202]:
series = frame.iloc[0]

In [203]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [204]:
series

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

In [205]:
# By default, arithmetic between DataFrame and Series matches the index of the Series on the 
# DataFrame's columns, broadcasting down the rows
frame - series

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

In [206]:
# If an index value is not found in either the DataFrame's columns or the Series's index
# the objects will be reindexed from the union
series2 = pd.Series(range(3), index = ['b', 'e', 'f'])

In [207]:
frame + series2

          b   d     e   f
Utah    0.0 NaN   3.0 NaN
Ohio    3.0 NaN   6.0 NaN
Texas   6.0 NaN   9.0 NaN
Oregon  9.0 NaN  12.0 NaN

In [208]:
series2

b    0
e    1
f    2
dtype: int64

In [209]:
# if you want to instead broadcast over the columns, matching on the rows, you have to use
# one of the arithmetic methods
series3 = frame['d']

In [210]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [211]:
series3

Utah       1.0
Ohio       4.0
Texas      7.0
Oregon    10.0
Name: d, dtype: float64

In [212]:
frame.sub(series3, axis = 'index')

          b    d    e
Utah   -1.0  0.0  1.0
Ohio   -1.0  0.0  1.0
Texas  -1.0  0.0  1.0
Oregon -1.0  0.0  1.0

In [213]:
# The axis number that you pass is the axis to match on.
# In this case we mean to match on teh DataFrame's row index (axis = 'index', axis = 0) and 
# broadcast across

In [214]:
# Function Application and Mapping

# NumPy ufuncs (element-wise array methods) also work with pandas objects
frame = pd.DataFrame(np.random.randn(4, 3), columns=list('bde'),
                     index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [215]:
frame

               b         d         e
Utah   -0.243838 -1.222501  0.120379
Ohio    1.033290 -0.500999 -1.005599
Texas  -0.610227 -1.304091 -1.468508
Oregon -1.580831 -0.371906 -1.150798

In [216]:
np.abs(frame)

               b         d         e
Utah    0.243838  1.222501  0.120379
Ohio    1.033290  0.500999  1.005599
Texas   0.610227  1.304091  1.468508
Oregon  1.580831  0.371906  1.150798

In [217]:
# Applying a function on one-dimensional arrays to each column or row
f = lambda x: x.max() - x.min()

In [218]:
frame.apply(f)

b    2.614120
d    0.932186
e    1.588887
dtype: float64

In [219]:
# If you pass axis = 'columns' to apply, the function will be invoked once per row instead
frame.apply(f, axis = 'columns')

Utah      1.342881
Ohio      2.038889
Texas     0.858281
Oregon    1.208925
dtype: float64

In [220]:
# The function passed to apply need not return a scalar value
# it can also return a Series with multiple values
def f(x):
    return pd.Series([x.min(), x.max()], index = ['min', 'max'])

In [221]:
frame.apply(f)

            b         d         e
min -1.580831 -1.304091 -1.468508
max  1.033290 -0.371906  0.120379

In [222]:
frame

               b         d         e
Utah   -0.243838 -1.222501  0.120379
Ohio    1.033290 -0.500999 -1.005599
Texas  -0.610227 -1.304091 -1.468508
Oregon -1.580831 -0.371906 -1.150798

In [223]:
# applymap
# compute a formatted string from each floating-point value in frame
format = lambda x: '%.2f'% x

In [224]:
frame.applymap(format)

            b      d      e
Utah    -0.24  -1.22   0.12
Ohio     1.03  -0.50  -1.01
Texas   -0.61  -1.30  -1.47
Oregon  -1.58  -0.37  -1.15

In [225]:
# The reason for the name applymap is that Series has a map method for applying an 
# element-wise function
frame['e'].map(format)

Utah       0.12
Ohio      -1.01
Texas     -1.47
Oregon    -1.15
Name: e, dtype: object

In [226]:
# Sorting and Ranking
obj = pd.Series(range(4), index = ['d', 'a', 'b', 'c'])

In [227]:
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [228]:
# With a DataFrame, can sort by index on either axis
frame = pd.DataFrame(np.arange(8).reshape((2, 4)),
                     index=['three', 'one'],
                     columns=['d', 'a', 'b', 'c'])

In [229]:
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [230]:
frame.sort_index(axis = 1)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [231]:
# sorted in descending
frame.sort_index(axis = 1, ascending = False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [232]:
# To sort a Series by its values, use its sort_values method
obj = pd.Series([4, 7, -3, 2])

In [233]:
obj.sort_values()

2   -3
3    2
0    4
1    7
dtype: int64

In [234]:
# missing values are sorted to the end of the Series by default
obj = pd.Series([4, np.nan, 7, np.nan, -3, 2])

In [235]:
obj.sort_values()

4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

In [236]:
# When sorting a DataFrame, can use the data in one or more columns as the sort keys
frame = pd.DataFrame({'b': [4, 7, -3, 2], 'a': [0, 1, 0, 1]})

In [237]:
frame

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

In [238]:
frame.sort_values(by='b')

   b  a
2 -3  0
3  2  1
0  4  0
1  7  1

In [239]:
frame.sort_values(by=['a', 'b'])

   b  a
2 -3  0
0  4  0
3  2  1
1  7  1

In [240]:
# Ranking assigns ranks from one through the number of valid data points in an array
# The rank methods for Series and DataFrame are the place to look
# By default rank breaks ties by assigning each group the mean ranks
obj = pd.Series([7, -5, 7, 4, 2, 0, 4])

In [241]:
obj

0    7
1   -5
2    7
3    4
4    2
5    0
6    4
dtype: int64

In [242]:
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [243]:
# rank can also be assigned according to the order in which they're observed in the data
obj.rank(method = 'first')

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [244]:
# Instead of using the average rank 6.5 for the entries 0 and 2, they instead have been 
# set to 6 and 7 becasue label 0 precedes label 2 in the data

# Assign tie values the maximum rank in the group
obj.rank(ascending = False, method = 'max')

0    2.0
1    7.0
2    2.0
3    4.0
4    5.0
5    6.0
6    4.0
dtype: float64

In [245]:
# DataFrame can compute ranks over the rows or the columns
frame = pd.DataFrame({'b': [4.3, 7, -3, 2], 'a': [0, 1, 0, 1],
                      'c': [-2, 5, 8, -2.5]})

In [246]:
frame

     b  a    c
0  4.3  0 -2.0
1  7.0  1  5.0
2 -3.0  0  8.0
3  2.0  1 -2.5

In [247]:
frame.rank(axis = 'columns')

     b    a    c
0  3.0  2.0  1.0
1  3.0  1.0  2.0
2  1.0  2.0  3.0
3  3.0  2.0  1.0

In [248]:
# Tie-breaking methods with rank

# 'average': Default: assign the average rank to each entry in the equal group
# 'min': Use the minimum rank for the whole group
# 'max': Use the maximum rank for the whole group
# 'first': Assign ranks in the order the values appear in the data
# 'dense': Like method = 'min', but ranks always increase by 1 in between groups 
# rather than the number of equal elements in a group

In [249]:
# Axis Indexes with Duplicate Labels
obj = pd.Series(range(5), index=['a', 'a', 'b', 'b', 'c'])

In [250]:
obj

a    0
a    1
b    2
b    3
c    4
dtype: int64

In [251]:
# The index's is_unique property can tell you whether its labels are unique or not
obj.index.is_unique

False

In [252]:
# Indexing a label with multiple entries returns a Series, while single entries return
# a scalar value
obj['a']

a    0
a    1
dtype: int64

In [253]:
obj['c']

4

In [256]:
# This can make the code more complicated, as the type from indexing can vary based on
# whether a label is repeated or not
df = pd.DataFrame(np.random.randn(4, 3), index=['a', 'a', 'b', 'b'])

In [257]:
df

          0         1         2
a  0.344423 -0.391894  1.075316
a  1.022198 -0.139447 -0.003612
b -0.199540 -1.696928 -0.612542
b -1.936193  0.734332 -0.133351

In [258]:
df.loc['b']

          0         1         2
b -0.199540 -1.696928 -0.612542
b -1.936193  0.734332 -0.133351

In [259]:
# Summarizing and Computing Descriptive Statistics

# pandas: also has methods that extract a single value (like the sum or mean) from a Series or
# Series of values from the rows or columns of a DataFrame.
# Compared with the similar methods found on NumPy arrays, they have built-in handling for 
# missing data

In [260]:
df = pd.DataFrame([[1.4, np.nan], [7.1, -4.5],
                   [np.nan, np.nan], [0.75, -1.3]],
                   index=['a', 'b', 'c', 'd'],
                   columns=['one', 'two'])

In [261]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [262]:
# Calling DataFrame's sum method returns a Series containing column sums
df.sum()

one    9.25
two   -5.80
dtype: float64

In [263]:
# Passing axis = 'columns' or axis = 1 sums across the columns instead
df.sum(axis='columns')

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [264]:
# NA values are excluded unless the entire slice (row or column in this case) is NA.
# This can be disabled with the skipna option
df.mean(axis='columns', skipna=False)

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

In [265]:
# Options for reduction methods
# axis: Axis to reduce over; 0 for DataFrame's rows and 1 for columns
# skipna: Exclude missing values; True by default
# level: Reduce grouped by level if the axis is hierarchically indexed (MultiIndex)

In [267]:
# Some methods, like idmin and idxmax, return indirect statistics like the index value 
# where the minimum or maximum values are attained
df.idxmax()

one    b
two    d
dtype: object

In [268]:
# Other methods are accumulations
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [269]:
# Another type of method: neither a reduction nor an accumulation
# describe: producing multiple summary statistics in one shot
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [270]:
# On non-numeric data, describe produces alternative summary statistics
obj = pd.Series(['a', 'a', 'b', 'c'] * 4)

In [271]:
obj.describe()

count     16
unique     3
top        a
freq       8
dtype: object

In [272]:
# Descriptive and summary statistics

# count: Number of non-NA values
# describe: Compute set of summary statistics for Series or each DataFrame column
# min,max: Compute minimum and maximum values
# argmin, argmax: Compute index locations (integers) at which minimum or maximum value 
# obtained, respectively
#idxmin, idxmax: COmpute index labels at which minimum or maximum value obtained, respectively
# quantile: Compute sample quantile ranging from 0 to 1
# sum: Sum of values
# mean: Mean of values
# median: Arithmetic median (50% quantile) of values
# mad: Mean absolute deviation from mean value
# prod: Product of all values
# var: Sample variance of avlues
# std: Sampled standard deviation of values
# skew: Sample skewness (third moment) of values
# kurt: Sample kurtosis (fourth moment) of values
# cumsum: Cummulative sum of values
# cummin, cummax: Cumulative minimum or maximum of values, respectively
# cumprod: Cummulative product of values
# diff: COmpute first arithmetic difference (useful for time series)
# pct_change: Compute percent changes

In [273]:
# Correlation and Covariance
# Some summary statistics, like correlation and covariance, 
# are computed from pairs of arguments.

In [275]:
# Dataframes of stock prices and volumes obtained from Yahoo!

SyntaxError: invalid syntax (<ipython-input-275-3502dbbefbc7>, line 2)

In [277]:
import sys
!{sys.executable} -m pip install pandas-datareader

Collecting pandas-datareader
  Downloading https://files.pythonhosted.org/packages/22/f1/a02eea03628865c3d4c29849cda8c8a73f43358048aee47d79dfbfa6c6c3/pandas_datareader-0.9.0-py3-none-any.whl (107kB)
     || 112kB 9.7MB/s eta 0:00:01
Requirement already satisfied: requests>=2.19.0 in /Users/xcsm-pc/opt/anaconda3/lib/python3.7/site-packages (from pandas-datareader) (2.22.0)
Requirement already satisfied: pandas>=0.23 in /Users/xcsm-pc/opt/anaconda3/lib/python3.7/site-packages (from pandas-datareader) (0.25.1)
Requirement already satisfied: lxml in /Users/xcsm-pc/opt/anaconda3/lib/python3.7/site-packages (from pandas-datareader) (4.4.1)
Requirement already satisfied: certifi>=2017.4.17 in /Users/xcsm-pc/opt/anaconda3/lib/python3.7/site-packages (from requests>=2.19.0->pandas-datareader) (2019.9.11)
Requirement already satisfied: urllib3!=1.25.0,!=1.25.1,<1.26,>=1.21.1 in /Users/xcsm-pc/opt/anaconda3/lib/python3.7/site-packages (from requests>=2.19.0->pandas-datareader) (1.24.2)
Requirement already satisfied: idna<2.9,>=2.5 in /Users/xcsm-pc/opt/anaconda3/lib/python3.7/site-packages (from requests>=2.19.0->pandas-datareader) (2.8)
Requirement already satisfied: chardet<3.1.0,>=3.0.2 in /Users/xcsm-pc/opt/anaconda3/lib/python3.7/site-packages (from requests>=2.19.0->pandas-datareader) (3.0.4)
Requirement already satisfied: pytz>=2017.2 in /Users/xcsm-pc/opt/anaconda3/lib/python3.7/site-packages (from pandas>=0.23->pandas-datareader) (2019.3)
Requirement already satisfied: python-dateutil>=2.6.1 in /Users/xcsm-pc/opt/anaconda3/lib/python3.7/site-packages (from pandas>=0.23->pandas-datareader) (2.8.0)
Requirement already satisfied: numpy>=1.13.3 in /Users/xcsm-pc/opt/anaconda3/lib/python3.7/site-packages (from pandas>=0.23->pandas-datareader) (1.17.2)
Requirement already satisfied: six>=1.5 in /Users/xcsm-pc/opt/anaconda3/lib/python3.7/site-packages (from python-dateutil>=2.6.1->pandas>=0.23->pandas-datareader) (1.12.0)
Installing collected packages: pandas-datareader
Successfully installed pandas-datareader-0.9.0

In [280]:
import pandas_datareader.data as web

In [284]:
all_data = {ticker: web.get_data_yahoo(ticker)
           for ticker in ['AAPL', 'IBM', 'MSFT', 'GOOG']}

In [285]:
all_data

{'AAPL':                   High         Low        Open       Close       Volume  \
 Date
 2015-12-28   26.922501   26.545000   26.897499   26.705000  106816800.0
 2015-12-29   27.357500   26.715000   26.740000   27.184999  123724800.0
 2015-12-30   27.174999   26.795000   27.145000   26.830000  100855200.0
 2015-12-31   26.757500   26.205000   26.752501   26.315001  163649200.0
 2016-01-04   26.342501   25.500000   25.652500   26.337500  270597600.0
 ...                ...         ...         ...         ...          ...
 2020-12-18  129.100006  126.120003  128.960007  126.660004  192541500.0
 2020-12-21  128.309998  123.449997  125.019997  128.229996  121251600.0
 2020-12-22  134.410004  129.649994  131.610001  131.880005  168904800.0
 2020-12-23  132.429993  130.779999  132.160004  130.960007   88223700.0
 2020-12-24  133.460007  131.100006  131.320007  131.970001   54930100.0

              Adj Close
 Date
 2015-12-28   24.741419
 2015-12-29   25.186125
 2015-12-30   24.857229
 2015-12-31   24.380093
 2016-01-04   24.400942
 ...                ...
 2020-12-18  126.660004
 2020-12-21  128.229996
 2020-12-22  131.880005
 2020-12-23  130.960007
 2020-12-24  131.970001

 [1259 rows x 6 columns],
 'IBM':                   High         Low        Open       Close     Volume  \
 Date
 2015-12-28  138.039993  136.539993  137.740005  137.610001  3143400.0
 2015-12-29  140.059998  138.199997  138.250000  139.779999  3943700.0
 2015-12-30  140.440002  139.220001  139.580002  139.339996  2989400.0
 2015-12-31  139.100006  137.570007  139.070007  137.619995  3462100.0
 2016-01-04  135.970001  134.240005  135.600006  135.949997  5229400.0
 ...                ...         ...         ...         ...        ...
 2020-12-18  126.400002  124.970001  125.589996  125.849998  7552800.0
 2020-12-21  124.180000  121.720001  123.970001  123.389999  6115700.0
 2020-12-22  124.220001  122.410004  123.309998  123.610001  4336100.0
 2020-12-23  125.209999  123.739998  123.879997  123.900002  2693900.0
 2020-12-24  125.099998  124.209999  125.000000  124.690002  1761100.0

              Adj Close
 Date
 2015-12-28  109.641991
 2015-12-29  111.370964
 2015-12-30  111.020401
 2015-12-31  109.649956
 2016-01-04  108.319374
 ...                ...
 2020-12-18  125.849998
 2020-12-21  123.389999
 2020-12-22  123.610001
 2020-12-23  123.900002
 2020-12-24  124.690002

 [1259 rows x 6 columns],
 'MSFT':                   High         Low        Open       Close      Volume  \
 Date
 2015-12-28   55.950001   54.980000   55.349998   55.950001  22458300.0
 2015-12-29   56.849998   56.060001   56.290001   56.549999  27731400.0
 2015-12-30   56.779999   56.290001   56.470001   56.310001  21704500.0
 2015-12-31   56.189999   55.419998   56.040001   55.480000  27334100.0
 2016-01-04   54.799999   53.389999   54.320000   54.799999  53778000.0
 ...                ...         ...         ...         ...         ...
 2020-12-18  219.690002  216.020004  218.589996  218.589996  63354900.0
 2020-12-21  224.000000  217.279999  217.550003  222.589996  37181900.0
 2020-12-22  225.630005  221.850006  222.690002  223.940002  22612200.0
 2020-12-23  223.559998  220.800003  223.110001  221.020004  18699600.0
 2020-12-24  223.610001  221.199997  221.419998  222.750000  10550600.0

              Adj Close
 Date
 2015-12-28   51.056156
 2015-12-29   51.603676
 2015-12-30   51.384666
 2015-12-31   50.627274
 2016-01-04   50.006744
 ...                ...
 2020-12-18  218.589996
 2020-12-21  222.589996
 2020-12-22  223.940002
 2020-12-23  221.020004
 2020-12-24  222.750000

 [1259 rows x 6 columns],
 'GOOG':                    High          Low         Open        Close   Volume  \
 Date
 2015-12-28   762.989990   749.520020   752.919983   762.510010  1515300
 2015-12-29   779.979980   766.429993   766.690002   776.599976  1765000
 2015-12-30   777.599976   766.900024   776.599976   771.000000  1293300
 2015-12-31   769.500000   758.340027   769.500000   758.880005  1500900
 2016-01-04   744.059998   731.257996   743.000000   741.840027  3272800
 ...                 ...          ...          ...          ...      ...
 2020-12-18  1755.109985  1720.219971  1754.180054  1731.010010  4016400
 2020-12-21  1740.849976  1699.000000  1713.510010  1739.369995  1828400
 2020-12-22  1737.405029  1712.574951  1734.430054  1723.500000   936700
 2020-12-23  1747.989990  1725.040039  1728.109985  1732.380005  1033800
 2020-12-24  1746.000000  1729.109985  1735.000000  1738.849976   346800

               Adj Close
 Date
 2015-12-28   762.510010
 2015-12-29   776.599976
 2015-12-30   771.000000
 2015-12-31   758.880005
 2016-01-04   741.840027
 ...                 ...
 2020-12-18  1731.010010
 2020-12-21  1739.369995
 2020-12-22  1723.500000
 2020-12-23  1732.380005
 2020-12-24  1738.849976

 [1259 rows x 6 columns]}

In [286]:
price = pd.DataFrame({ticker: data['Adj Close']
                     for ticker, data in all_data.items()})

In [287]:
volume = pd.DataFrame({ticker: data['Volume']
                      for ticker, data in all_data.items()})

In [288]:
price

                  AAPL         IBM        MSFT         GOOG
Date
2015-12-28   24.741419  109.641991   51.056156   762.510010
2015-12-29   25.186125  111.370964   51.603676   776.599976
2015-12-30   24.857229  111.020401   51.384666   771.000000
2015-12-31   24.380093  109.649956   50.627274   758.880005
2016-01-04   24.400942  108.319374   50.006744   741.840027
...                ...         ...         ...          ...
2020-12-18  126.660004  125.849998  218.589996  1731.010010
2020-12-21  128.229996  123.389999  222.589996  1739.369995
2020-12-22  131.880005  123.610001  223.940002  1723.500000
2020-12-23  130.960007  123.900002  221.020004  1732.380005
2020-12-24  131.970001  124.690002  222.750000  1738.849976

[1259 rows x 4 columns]

In [289]:
volume

                   AAPL        IBM        MSFT     GOOG
Date
2015-12-28  106816800.0  3143400.0  22458300.0  1515300
2015-12-29  123724800.0  3943700.0  27731400.0  1765000
2015-12-30  100855200.0  2989400.0  21704500.0  1293300
2015-12-31  163649200.0  3462100.0  27334100.0  1500900
2016-01-04  270597600.0  5229400.0  53778000.0  3272800
...                 ...        ...         ...      ...
2020-12-18  192541500.0  7552800.0  63354900.0  4016400
2020-12-21  121251600.0  6115700.0  37181900.0  1828400
2020-12-22  168904800.0  4336100.0  22612200.0   936700
2020-12-23   88223700.0  2693900.0  18699600.0  1033800
2020-12-24   54930100.0  1761100.0  10550600.0   346800

[1259 rows x 4 columns]

In [290]:
# Compute the percent changes of the prices
returns = price.pct_change()

In [291]:
returns.tail()

                AAPL       IBM      MSFT      GOOG
Date
2020-12-18 -0.015851  0.002389 -0.003783 -0.009663
2020-12-21  0.012395 -0.019547  0.018299  0.004830
2020-12-22  0.028465  0.001783  0.006065 -0.009124
2020-12-23 -0.006976  0.002346 -0.013039  0.005152
2020-12-24  0.007712  0.006376  0.007827  0.003735

In [294]:
# The corr method of Series computes the correlation of the overlapping, non-NA,
# aligned-by-index values in two Series. 
returns['MSFT'].corr(returns['IBM'])

0.5543013475296674

In [295]:
returns['MSFT'].cov(returns['IBM'])

0.00015782827517326866

In [296]:
# Since MSFT is a valid Python attribute, we can select these columns using more concise syntax
returns.MSFT.corr(returns.IBM)

0.5543013475296674

In [297]:
# DataFrame's corr and cov methods, on the other hand, return a full correlation or covariance
# matrix as a DataFrame, respectively
returns.corr()

          AAPL       IBM      MSFT      GOOG
AAPL  1.000000  0.470220  0.714354  0.654785
IBM   0.470220  1.000000  0.554301  0.518586
MSFT  0.714354  0.554301  1.000000  0.778225
GOOG  0.654785  0.518586  0.778225  1.000000

In [298]:
returns.cov()

          AAPL       IBM      MSFT      GOOG
AAPL  0.000361  0.000145  0.000237  0.000207
IBM   0.000145  0.000265  0.000158  0.000140
MSFT  0.000237  0.000158  0.000306  0.000226
GOOG  0.000207  0.000140  0.000226  0.000276

In [299]:
# Using DataFrame's corrwith method, you can compute pairwise correlations between a DataFrame's
# columns or rows with another Series or DataFrame
returns.corrwith(returns.IBM)

AAPL    0.470220
IBM     1.000000
MSFT    0.554301
GOOG    0.518586
dtype: float64

In [300]:
returns.corrwith(volume)

AAPL   -0.092096
IBM    -0.076561
MSFT   -0.094487
GOOG   -0.164705
dtype: float64

In [301]:
# Passing axis= 'columns' does things row-by-row instead

In [302]:
# Unique Values, Value Counts, and Membership

In [303]:
# Etracts information about the values contained in a one-dimensioanl Series

In [305]:
obj = pd.Series(['c', 'a', 'd', 'a', 'a', 'b', 'b', 'c', 'c'])

In [306]:
uniques = obj.unique()

In [307]:
uniques
# unique values are not necessarily returned in sorted order

array(['c', 'a', 'd', 'b'], dtype=object)

In [308]:
# value_counts computes a Series containing value frequencies
obj.value_counts()

c    3
a    3
b    2
d    1
dtype: int64

In [309]:
# The Series is sorted by value in descending order as a convenience.
# value_counts is also available as a top-level pandas method that can be used with any array
# or sequence
pd.value_counts(obj.values, sort=False)

a    3
b    2
c    3
d    1
dtype: int64

In [310]:
# isin performs a vectorized set membership check and can be useful in filtering a dataset
# down to a subset of avleus in a Series or column in a DataFrameobj

In [311]:
obj

0    c
1    a
2    d
3    a
4    a
5    b
6    b
7    c
8    c
dtype: object

In [312]:
mask = obj.isin(['b', 'c'])

In [313]:
mask

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [314]:
obj[mask]

0    c
5    b
6    b
7    c
8    c
dtype: object

In [315]:
# Related to isin is the Index.get_indexer method, which gives you an index array of possibly
# non-distinct values into another array of distinct values
to_match = pd.Series(['c', 'a', 'b', 'b', 'c', 'a'])
unique_vals = pd.Series(['c', 'b', 'a'])

In [316]:
pd.Index(unique_vals)

Index(['c', 'b', 'a'], dtype='object')

In [317]:
pd.Index(unique_vals).get_indexer(to_match)

array([0, 2, 1, 1, 0, 2])

In [ ]:
# Unique, value counts, and set membership methods

# isin:
# match: Compute integer indices for each value in an array into another array of distinct
# values; helpful for data alignment and join-type operations
# unique
# value_counts

In [318]:
# Compute a histogram on multiple related columns in a DataFrame
data = pd.DataFrame({'Qu1': [1, 3, 4, 3, 4],
                    'Qu2': [2, 3, 1, 2, 3],
                    'Qu3': [1, 5, 2, 4, 4]})

In [319]:
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [320]:
# Passing pandas.value_counts to this DataFrame's apply function gives
result = data.apply(pd.value_counts).fillna(0)

In [321]:
result

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0